codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efe100.h
#define _CNNEG_CNNEG0_POSITION                   0x00000000
#define _CNNEG_CNNEG0_MASK                       0x00000001
#define _CNNEG_CNNEG0_LENGTH                     0x00000001

#define _CNNEG_CNNEG1_POSITION                   0x00000001
#define _CNNEG_CNNEG1_MASK                       0x00000002
#define _CNNEG_CNNEG1_LENGTH                     0x00000001

#define _CNNEG_CNNEG6_POSITION                   0x00000006
#define _CNNEG_CNNEG6_MASK                       0x00000040
#define _CNNEG_CNNEG6_LENGTH                     0x00000001

#define _CNNEG_CNNEG7_POSITION                   0x00000007
#define _CNNEG_CNNEG7_MASK                       0x00000080
#define _CNNEG_CNNEG7_LENGTH                     0x00000001

#define _CNNEG_CNNEG8_POSITION                   0x00000008
#define _CNNEG_CNNEG8_MASK                       0x00000100
#define _CNNEG_CNNEG8_LENGTH                     0x00000001

#define _CNNEG_CNNEG9_POSITION                   0x00000009
#define _CNNEG_CNNEG9_MASK                       0x00000200
#define _CNNEG_CNNEG9_LENGTH                     0x00000001

#define _CNNEG_CNNEG12_POSITION                  0x0000000C
#define _CNNEG_CNNEG12_MASK                      0x00001000
#define _CNNEG_CNNEG12_LENGTH                    0x00000001

#define _CNNEG_CNNEG13_POSITION                  0x0000000D
#define _CNNEG_CNNEG13_MASK                      0x00002000
#define _CNNEG_CNNEG13_LENGTH                    0x00000001

#define _CNNEG_CNNEG14_POSITION                  0x0000000E
#define _CNNEG_CNNEG14_MASK                      0x00004000
#define _CNNEG_CNNEG14_LENGTH                    0x00000001

#define _CNNEG_CNNEG15_POSITION                  0x0000000F
#define _CNNEG_CNNEG15_MASK                      0x00008000
#define _CNNEG_CNNEG15_LENGTH                    0x00000001

#define _CNFG_CNFG0_POSITION                     0x00000000
#define _CNFG_CNFG0_MASK                         0x00000001
#define _CNFG_CNFG0_LENGTH                       0x00000001

#define _CNFG_CNFG1_POSITION                     0x00000001
#define _CNFG_CNFG1_MASK                         0x00000002
#define _CNFG_CNFG1_LENGTH                       0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _CNFG_CNFG12_POSITION                    0x0000000C
#define _CNFG_CNFG12_MASK                        0x00001000
#define _CNFG_CNFG12_LENGTH                      0x00000001

#define _CNFG_CNFG13_POSITION                    0x0000000D
#define _CNFG_CNFG13_MASK                        0x00002000
#define _CNFG_CNFG13_LENGTH                      0x00000001

#define _CNFG_CNFG14_POSITION                    0x0000000E
#define _CNFG_CNFG14_MASK                        0x00004000
#define _CNFG_CNFG14_LENGTH                      0x00000001

#define _CNFG_CNFG15_POSITION                    0x0000000F
#define _CNFG_CNFG15_MASK                        0x00008000
#define _CNFG_CNFG15_LENGTH                      0x00000001

#define _SRCON0G_SR0G6_POSITION                  0x00000006
#define _SRCON0G_SR0G6_MASK                      0x00000040
#define _SRCON0G_SR0G6_LENGTH                    0x00000001

#define _SRCON0G_SR0G9_POSITION                  0x00000009
#define _SRCON0G_SR0G9_MASK                      0x00000200
#define _SRCON0G_SR0G9_LENGTH                    0x00000001

#define _SRCON0G_SR0G12_POSITION                 0x0000000C
#define _SRCON0G_SR0G12_MASK                     0x00001000
#define _SRCON0G_SR0G12_LENGTH                   0x00000001

#define _SRCON0G_SR0G13_POSITION                 0x0000000D
#define _SRCON0G_SR0G13_MASK                     0x00002000
#define _SRCON0G_SR0G13_LENGTH                   0x00000001

#define _SRCON0G_SR0G14_POSITION                 0x0000000E
#define _SRCON0G_SR0G14_MASK                     0x00004000
#define _SRCON0G_SR0G14_LENGTH                   0x00000001

#define _SRCON1G_SR1G6_POSITION                  0x00000006
#define _SRCON1G_SR1G6_MASK                      0x00000040
#define _SRCON1G_SR1G6_LENGTH                    0x00000001

#define _SRCON1G_SR1G9_POSITION                  0x00000009
#define _SRCON1G_SR1G9_MASK                      0x00000200
#define _SRCON1G_SR1G9_LENGTH                    0x00000001

#define _SRCON1G_SR1G12_POSITION                 0x0000000C
#define _SRCON1G_SR1G12_MASK                     0x00001000
#define _SRCON1G_SR1G12_LENGTH                   0x00000001

#define _SRCON1G_SR1G13_POSITION                 0x0000000D
#define _SRCON1G_SR1G13_MASK                     0x00002000
#define _SRCON1G_SR1G13_LENGTH                   0x00000001

#define _SRCON1G_SR1G14_POSITION                 0x0000000E
#define _SRCON1G_SR1G14_MASK                     0x00004000
#define _SRCON1G_SR1G14_LENGTH                   0x00000001

#define _ETHCON1_BUFCDEC_POSITION                0x00000000
#define _ETHCON1_BUFCDEC_MASK                    0x00000001
#define _ETHCON1_BUFCDEC_LENGTH                  0x00000001

#define _ETHCON1_MANFC_POSITION                  0x00000004
#define _ETHCON1_MANFC_MASK                      0x00000010
#define _ETHCON1_MANFC_LENGTH                    0x00000001

#define _ETHCON1_AUTOFC_POSITION                 0x00000007
#define _ETHCON1_AUTOFC_MASK                     0x00000080
#define _ETHCON1_AUTOFC_LENGTH                   0x00000001

#define _ETHCON1_RXEN_POSITION                   0x00000008
#define _ETHCON1_RXEN_MASK                       0x00000100
#define _ETHCON1_RXEN_LENGTH                     0x00000001

#define _ETHCON1_TXRTS_POSITION                  0x00000009
#define _ETHCON1_TXRTS_MASK                      0x00000200
#define _ETHCON1_TXRTS_LENGTH                    0x00000001

#define _ETHCON1_SIDL_POSITION                   0x0000000D
#define _ETHCON1_SIDL_MASK                       0x00002000
#define _ETHCON1_SIDL_LENGTH                     0x00000001

#define _ETHCON1_ON_POSITION                     0x0000000F
#define _ETHCON1_ON_MASK                         0x00008000
#define _ETHCON1_ON_LENGTH                       0x00000001

#define _ETHCON1_PTV_POSITION                    0x00000010
#define _ETHCON1_PTV_MASK                        0xFFFF0000
#define _ETHCON1_PTV_LENGTH                      0x00000010

#define _ETHCON1_w_POSITION                      0x00000000
#define _ETHCON1_w_MASK                          0xFFFFFFFF
#define _ETHCON1_w_LENGTH                        0x00000020

#define _ETHCON2_RXBUF_SZ_POSITION               0x00000004
#define _ETHCON2_RXBUF_SZ_MASK                   0x000007F0
#define _ETHCON2_RXBUF_SZ_LENGTH                 0x00000007

#define _ETHCON2_w_POSITION                      0x00000000
#define _ETHCON2_w_MASK                          0xFFFFFFFF
#define _ETHCON2_w_LENGTH                        0x00000020

#define _ETHTXST_TXSTADDR_POSITION               0x00000002
#define _ETHTXST_TXSTADDR_MASK                   0xFFFFFFFC
#define _ETHTXST_TXSTADDR_LENGTH                 0x0000001E

#define _ETHTXST_w_POSITION                      0x00000000
#define _ETHTXST_w_MASK                          0xFFFFFFFF
#define _ETHTXST_w_LENGTH                        0x00000020

#define _ETHRXST_RXSTADDR_POSITION               0x00000002
#define _ETHRXST_RXSTADDR_MASK                   0xFFFFFFFC
#define _ETHRXST_RXSTADDR_LENGTH                 0x0000001E

